// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

/*
Console.WriteLine("Input first number ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input second Number ");
int b = Convert.ToInt32(Console.ReadLine());

if (a > b)
    Console.WriteLine($"Larger {a}, Smaller {b}");
else
    Console.WriteLine($"Larger {b}, Smaller {a}");
*/

//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

/*
Console.WriteLine("Input first number ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input second Number ");
int b = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input third Number ");
int c = Convert.ToInt32(Console.ReadLine());
int max = a;

if (max < b)
    max = b;
if (c > max)
    max = c;

Console.WriteLine("Max = " + max);
*/